[
{
	"company_name": "Prometheus Group",
	"position_title": "Web Developer",
	"description": "Work with a small team in a dynamic startup-like environment to develop, deliver, and support a suite of enterprise web applications. Our team's aim is to deliver a best-in-class web 2.0 experience to users across a variety of industries, with a focus on consistent and appealing design. Developers will gain a detailed understanding of core business processes used throughout the oil and gas, chemical, utilities, mining, and manufacturing industries and build a wealth of experience in a variety of software development technologies through on the job training. The team implements a product ownership model, following all software from initial concept to development, implementation, and long-term maintenance, with a strong focus on new product development.",
	"url": "https://www.dice.com/jobs/detail/Web-Developer-Prometheus-Group-Raleigh-NC-27608/10471488/332463?icid=sr1-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Kelly IT Resources",
	"position_title": "Front End Web Developer",
	"description": "We are seeking a talented Front End Web Developer who is passionate about building beautiful websites and applications, while delivering high-quality user experiences for our customers and internal users. You will implement and maintain customer-facing, front-end web pages supporting our online eCommerce, Sales, Marketing and Customer Support initiatives. Projects will include extensions and improvements to our existing web sites, development of marketing micro-sites and internal web-based tools. You should be comfortable with creating and implementing modern, responsive, optimized, and SEO friendly visual designs. We are looking for a hands-on, senior level developer that can join our technology team, working along creative designers and server-side developers. This person should be able to hit the ground running, is self-motivated, and can deliver business value in an environment that fosters creativity and imagination.",
	"url": "https://www.dice.com/jobs/detail/Front-End-Web-Developer-Kelly-IT-Morrisville-NC-27560/10114756a/088050?icid=sr2-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Data Staff, Inc.",
	"position_title": "Sr. Full-Stack JavaScript Web Developer",
	"description": "This role is for a Sr. Full-Stack JavaScript Web Developer. The Web Applications Team develops and maintains line-of-business web applications, and public web-sites for the Client. The Sr. Developer will fill the role of full-stack JavaScript developer who will be an instrumental part of our team, focusing on the development of web and mobile applications using technologies such as NativeScript and React Native. The Sr. Developer will work with a research team of talented scientists, clinicians and engineers to deliver next generation point-of-care technologies. This position reports to the Manager of Application Development.",
	"url": "https://www.dice.com/jobs/detail/Sr.-Full%26%2345Stack-JavaScript-Web-Developer-DataStaff%2C-Inc.-Durham-NC-27707/10109342/325?icid=sr3-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Robert Half Technology",
	"position_title": "Sr Web Developer",
	"description": "Write well designed, efficient code by using best software development practices. Test code for quality, accessibility and site speed. Gather and refine specifications and requirements based on the technical needs of our higher-ed clients. Collaborate with our designers to match visual design intent. Proactively recognize problems and develop creative solutions from the strategy phase of a project through development and launch. Create and maintain software documentation. Stay plugged into emerging technologies/industry trends and apply them into company operations and activities. Track and identify new opportunities to improve processes. Assist in strategic sales efforts (including project scoping) from a technical perspective. Consistently deliver high-quality services to our clients.",
	"url": "https://www.dice.com/jobs/detail/Sr-Web-Developer-Robert-Half-Technology-Raleigh-NC-27612/rhalfint/03220%26%23450010151559?icid=sr4-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Net Esolutions Corporation",
	"position_title": "Drupal Web Developer",
	"description": "NETE is seeking a highly motivated, flexible, organized, and detail oriented Drupal Web Developer to join our dynamic team. If you want to learn, grow, and help then this is the job for you. We support a project/customer that seeks to better understand, treat, and ultimately prevent infectious, immunologic, and allergic disease seeks fundamental knowledge about the nature and behavior of living systems and the application of that knowledge to enhance health, lengthen life, and reduce illness and disability. What you do matters and has significant impact on the medical and scientific communities we serve. Your work here really matters and has real impact.",
	"url": "https://www.dice.com/jobs/detail/Drupal-Web-Developer-NETE-Morrisville-NC-27560/10203295/394988?icid=sr6-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "SharkDreams",
	"position_title": "Lead Back -End /Full Stack Web Developer(No Sponsorship)",
	"description": "SharkDreams is a digital healthcare company redefining the way patient health is monitored. We combine our software and hardware technology with cloud-based data analytics and artificial intelligence capabilities. Our team is looking for a Passionate, high energy and highly skilled software engineer to support our software division. Engineer will work with our talented teams to design and build the next generation software applications.",
	"url": "https://www.dice.com/jobs/detail/Lead-Back-%26%2345End-%26%2347Full-Stack-Web-Developer%28No-Sponsorship-%29-SharkDreams-Raleigh-NC-27601/91010781/241746?icid=sr7-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Data Staff, Inc.",
	"position_title": "Sr. Web Developer",
	"description": "DataStaff is currently seeking to fill a direct hire opportunity for a Sr. Web Developer with one of our direct clients in Durham, NC. This role is for a Sr. Full-Stack JavaScript Web Developer. The Web Applications Team develops and maintains line-of-business web applications, and public web-sites for the Client. The Sr. Developer will fill the role of full-stack JavaScript developer who will be an instrumental part of our team, focusing on the development of web and mobile applications using technologies such as NativeScript and React Native. The Sr. Developer will work with a research team of talented scientists, clinicians and engineers to deliver next generation point-of-care technologies. This position reports to the Manager of Application Development.",
	"url": "https://www.dice.com/jobs/detail/Sr.-Web-Developer-DataStaff%2C-Inc.-Durham-NC-27707/10109342/402888?icid=sr8-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Chandra Technologies, Inc.",
	"position_title": ".NET Web Developer",
	"description": "We are considering the highest possible rate for consultants on CTC/ 1099 with State of North Carolina experience / Local consultants to Raleigh NC with all matching skills in the skillset. We deduct only $2.00/hour for any billable work as our margin from the client max rate after their admin fees.",
	"url": "https://www.dice.com/jobs/detail/.NET-Web-Developer-Chandra-Technologies%2C--Inc.-Raleigh-NC-27601/10121151/NC%26%2345DOJ%26%2345NET0409?icid=sr9-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Matrix Resources",
	"position_title": "Web Developer",
	"description": "Seeking a Web Developer for a contract position in Durham, NC! - The Web Developer will develop websites and Internet applications-using-web development technologies such as HTML, JavaScript, AJAX, Babel, Node JS, Vue JS, React, Rest API, GIT-and CSS.- Perform various coding and programming tasks, such as design or development of Web front-end, back-end Web-based applications, and Web/Internet services.- May involve coding and integration of text, graphics, sound, and/or video.--A majority of this team's work is directly related to external client facing websites.",
	"url": "https://www.dice.com/jobs/detail/Web-Developer-Matrix-Resources-Durham-NC-27701/matrixga/140275?icid=sr10-1p&q=web+developer&l=Durham,%20NC",
},
{
	"company_name": "Trigyn Technologies, Inc.",
	"position_title": "Web Developer (.NET / Web Services / TFS)",
	"description": "This is a senior level position which requires strong software development knowledge and subject matter expertise in topics such as object-oriented design, relational database design, software development methodologies and processes. An initial task is to lead the design and deployment effort to create the framework for an external Web Portal for the Division application. The consultant must have prior experience in developing a external web portal to capture data from external users. Individual must have knowledge of application security. Successful consultant will periodically meet with customers to clarify specific requirements. Thus this position requirements strong oral and written communication skills.",
	"url": "https://www.dice.com/jobs/detail/Web-Developer-%28.NET-%26%2347-Web-Services-%26%2347-TFS%29-TRIGYN-TECHNOLOGIES%2C-INC.-Raleigh-NC-27601/trinj/B0418%26%23450011%26%2345IB?icid=sr15-1p&q=web+developer&l=Durham,%20NC",
}
]	